Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: PEAR today includes a wide variety of infrastructure foundation classes for database access, content caching, mathematical calculations, eCommerce and much more.
es: PEAR hoy incluye una gran variedad de clases de infraestructura para acceso a bases de datos, caché de contenido, cálculos matemáticos, comercio electrónico y mucho más.

source: The PHP Quality Assurance Initiative was set up in the summer of 2000 in response to criticism that PHP releases were not being tested well enough for production environments.
es: La Iniciativa para la Garantía de Calidad de PHP se configuró en el verano de 2000 en respuesta a los que criticaban que las versiones de PHP se liberaban sin que fueran comprobadas suficientemente para entornos de producción.

source: The team now consists of a core group of developers with a good understanding of the PHP code base.
es: El equipo ahora consiste en un grupo central de desarrolladores con un buen entendimiento del código base de PHP.

source: These developers spend a lot of their time localizing and fixing bugs within PHP.
es: Estos desarrolladores gastan mucho tiempo localizando y solucionando problemas con PHP.

source: In addition there are many other team members who test and provide feedback on these fixes using a wide variety of platforms.
es: Además, hay muchos miembros de otros equipos que testean y prueban estas soluciones usando una gran variedad de plataformas.

source: PHP-GTK is the PHP solution for writing client side GUI applications.
es: PHP-GTK es la solución PHP para escribir las aplicaciones GUI del lado del cliente.

source: Andrei Zmievski remembers the planing and creation process of PHP-GTK:
es: Andrei Zmievski recuerda la planificación y la creación del proceso de PHP-GTK:

source: GUI programming has always been of my interests, and I found that Gtk + is a very nice toolkit, except that programming with it in C is somewhat tedious.
es: Programar GUI siempre ha estado entre mis intereses, y he encontrado que Gtk + es una herramienta muy buena, salvo que programar con ella en C es algo tedioso.

source: After witnessing PyGtk and GTK-Perl implementations, I decided to see if PHP could be made to interface with Gtk+, even minimally.
es: Tras presenciar las implementaciones de PyGtk y GTK-Perl, decidí ver si PHP se podría hacer con la interfaz Gtk+, incluso mínimamente.

source: Starting in August of 2000, I began to have a bit more free time so that is when I started experimenting.
es: En Agosto de 2000 empecé a tener más tiempo libre, con lo que comencé a experimentar.

source: My main guideline was the PyGtk implementation as it was fairly feature complete and had a nice object-oriented interface.
es: Mi principal guía fue la implementación PyGtk con características completas bastante buenas y con un buen interfaz orientado a objetos.

source: James Henstridge, the author of PyGtk, provided very helpful advice during those initial stages.
es: James Henstridge, el autor de PyGtk, proveyó mucha ayuda adicional durante esos estados iniciales.

source: Hand-writing the interfaces to all the Gtk + functions was out of the question, so I seized upon the idea of code-generator, similar to how PyGtk did it.
es: Escribir las interfaces de todas las funciones Gtk + estaba fuera de cuestión, por lo que mantuve la idea de generador de código, similar a cómo PyGtk lo hizo.

source: The code generator is a PHP program that reads a set of .defs file containing the Gtk + classes, constants, and methods information and generates C code that interfaces PHP with them.
es: El generador de código es un programa PHP que lee un conjunto de ficheros .defs que contienen las clases Gtk+, constantes e información de métodos y genera código C que interactúa PHP con ellos.

source: What cannot be generated automatically can be written by hand in .overrides file.
es: Lo que no se puede generar automáticamente puede escribirse a mano en ficheros .overrides.

source: Working on the code generator and the infrastructure took some time, because I could spend little time on PHP-GTK during the fall of 2000.
es: Trabajar en el generador de código y la infraestructura llevó algo de tiempo, porque pude dedicar poco tiempo a PHP-GTK durante el otoño de 2000.

source: After I showed PHP-GTK to Frank Kromann, he got interested and started helping me out with code generator work and Win32 implementation.
es: Después mostré PHP-GTK a Frank Kromann, que se interesó y empezó a ayudarme con el trabajo del generador de código y con la implementación para Win32.

source: When we wrote the first Hello World program and fired it up, it was extremely exciting.
es: Cuando escribimos el primer programa Hola Mundo y funcionó, fue extremadamente excitante.

source: It took a couple more months to get the project to a presentable condition and the initial version was released on March 1, 2001.
es: Llevó un par de meses más llevar el proyecto a una condición presentable y la versión inicial se liberó el 1 de Marzo de 2001.

source: The story promptly hit SlashDot.
es: La historia rápidamente llegó a SlashDot.

source: Sensing that PHP-GTK might be extensive, I set up separate mailing lists and CVS repositories for it, as well as the gtk.php.net website with the help of Colin Viebrock.
es: Sintiendo que PHP-GTK podría extenderse, configuré listas de correo separadas y repositorios CVS para ello, así como el sitio web gtk.php.net con la ayuda de Colin Viebrock.

source: The documentation would also need to be done and James Moore came in to help with that.
es: La documentación también tuvo que hacerse y James Moore llegó para ayudar en esto.

source: Since its release PHP-GTK has been gaining popularity.
es: Desde su lanzamiento PHP-GTK fue ganando popularidad.

source: We have our own documentation team, the manual keeps improving, people start writing extensions for PHP-GTK, and more and more exciting applications with it.
es: Tenemos nuestro propio equipo de documentación, el manual sigue mejorando, la gente ha comenzado a escribir extensiones para PHP-GTK, y con ello más y mejores aplicaciones.

source: Copyright © 1997, 1998, 1999, 2000, 2001, 2002, 2003 the PHP Documentation Group
es: Duplicating Variable Contents:

source: While setting up the server and PHP on your own, you have two choices for the method of connecting PHP to the server.
es: El código fuente y las distribuciones binarias para algunas plataformas (incluído Windows) se pueden encontrar en http: / /www.php.net /.

source: Unix / HP-UX installs
es: Instalación en sistemas UNIX

source: PHP (recursive acronym for "PHP:
es: Qué se puede hacer con PHP?

source: Hypertext Preprocessor") is a widely-used Open Source general-purpose scripting language that is especially suited for Web development and can be embedded into HTML.
es: Hypertext Preprocessor") es un lenguaje "open source "interpretado de alto nivel embebido en páginas HTML y ejecutado en el servidor.

source: Simple answer, but what does that mean?
es: Una respuesta corta y concisa, pero que significa realmente?

source: An example:
es: Un ejemplo nos aclarará las cosas:

source: Example 1-1.
es: Ejemplo 1-1.

source: An introductory example
es: Un ejemplo introductorio

source: Notice how this is different from a script written in other languages like Perl or C - - instead of writing a program with lots of commands to output HTML, you write an HTML script with some embedded code to do something (in this case, output some text).
es: Podemos ver que no es lo mismo que un script escrito en otro lenguaje de programación como Perl o C - - En vez de escribir un programa con muchos comandos para crear una salida en HTML, escribimos el código HTML con cierto código PHP embebido (introducido) en el mismo, que producirá cierta salida (en nuestro ejemplo, producir un texto).

source: The PHP code is enclosed in special start and end tags that allow you to jump into and out of "PHP mode".
es: El código PHP se incluye entre etiquetas especiales de comienzo y final que nos permitirán entrar y salir del modo PHP.

source: What distinguishes PHP from something like client-side JavaScript is that the code is executed on the server.
es: Lo que distingue a PHP de la tecnología Javascript, la cual se ejecuta en la máquina cliente, es que el código PHP es ejecutado en el servidor.

source: You can even configure your web server to process all your HTML files with PHP, and then there 's really no way that users can tell what you have up your sleeve.
es: El servidor web puede ser incluso configurado para que procese todos los ficheros HTML con PHP.

source: The best things in using PHP are that it is extremely simple for a newcomer, but offers many advanced features for a professional programmer.
es: Lo mejor de usar PHP es que es extremadamente simple para el principiante, pero a su vez, ofrece muchas caracteristicas avanzadas para los programadores profesionales.

source: You can jump in, in a short time, and start writing simple scripts in a few hours.
es: No tengais miedo de leer la larga lista de caracteristicas de PHP, en poco tiempo podreis empezar a escribir vuestros primeros scripts.

source: Although PHP 's development is focused on server-side scripting, you can do much more with it.
es: Aunque el desarrollo de PHP está concentrado en la programación de scripts en la parte del servidor, se puede utilizar para muchas otras cosas.

source: Read on, and see more in the What can PHP do? section.
es: Sigue leyendo y descubre más sobre PHP en la sección Qué se puede hacer con PHP?.

source: Getting Started
es: Conceptos Básicos

source: What can PHP do?
es: Qué se puede hacer con PHP?

source: Chapter 1.
es: Capítulo 1.

source: PHP is mainly focused on server-side scripting, so you can do anything any other CGI program can do, such as collect form data, generate dynamic page content, or send and receive cookies.
es: PHP puede hacer cualquier cosa que se pueda hacer con un script CGI, como procesar la información de formularios, generar páginas con contenidos dinámicos, o mandar y recibir cookies.

source: But PHP can do much more.
es: Y esto no es todo, se puede hacer mucho más.

source: There are three main fields where PHP scripts are used.
es: Existen tres campos en los que scripts escritos en PHP son usados.

source: Server-side scripting.
es: Scripts en la parte del servidor.

source: This is the most traditional and main target field for PHP.
es: Este es el campo más tradicional y el principal campo de trabajo.

source: You need three things to make this work.
es: Se necesitan tres cosas para que esto funcione.

source: The PHP parser (CGI or server module), a webserver and a web browser.
es: El analizador PHP (CGI ó módulo), un servidor web y un navegador.

source: You need to run the webserver, with a connected PHP installation.
es: Se necesita correr el servidor web con PHP instalado.

source: You can access the PHP program output with a web browser, viewing the PHP page through the server.
es: El resultado del programa PHP se puede obtener a través del navegador, conectando con el servidor web.

source: See the installation instructions section for more information.
es: Consultar la sección Instrucciones de instalación para más información.

source: Command line scripting.
es: Scripts en linea de comandos.

source: You can make a PHP script to run it without any server or browser.
es: Podeis crear un script PHP y correrlo sin ningún servidor web ó navegador.

source: You only need the PHP parser to use it this way.
es: Solamente necesitais el parseador PHP para usarlo de esta manera.

source: This type of usage is ideal for scripts regularly executed using cron (on *nix or Linux) or Task Scheduler (on Windows).
es: Este tipo de uso es ideal para scripts ejecutados regularmente desde cron (en *nix ó Linux) ó el Planificador de tareas (en Windows).

source: These scripts can also be used for simple text processing tasks.
es: Estos scripts tambien pueden ser usados para tareas simples de procesado de texto.

source: See the section about Command line usage of PHP for more information.
es: Consultar la sección Usos de PHP en la linea de comandos para más información.

source: Writing client-side GUI applications.
es: Escribir aplicaciones gráficas clientes.

source: PHP is probably not the very best language to write windowing applications, but if you know PHP very well, and would like to use some advanced PHP features in your client-side applications you can also use PHP-GTK to write such programs.
es: PHP no es probablemente el mejor lenguaje para escribir aplicaciones gráficas, pero si sabeis bien PHP, y os gustaria utilizar algunas características avanzadas en programas clientes, podeis utilizar PHP-GTK para escribir dichos programas.

source: You also have the ability to write cross-platform applications this way.
es: Es tambien posible escribir aplicaciones independientes de una plataforma.

source: PHP-GTK is an extension to PHP, not available in the main distribution.
es: PHP-GTK es una extensión de PHP, no disponible en la distribución principal.

source: If you are interested in PHP-GTK, visit it 's own website.
es: Si te interesa PHP-GTK, puedes visitar las páginas web del projecto.

source: PHP has also support for most of the web servers today.
es: PHP puede ser utilizado en cualquiera de los principales sistemas operativos del mercado, incluyendo Linux, muchas variantes Unix (incluido HP-UX, Solaris y OpenBSD), Microsoft Windows, Mac OS X, RISC OS y probablemente alguno más.

source: This includes Apache, Microsoft Internet Information Server, Personal Web Server, Netscape and iPlanet servers, Oreilly Website Pro server, Caudium, Xitami, OmniHTTPd, and many others.
es: PHP soporta la mayoría de servidores web de hoy en día, incluyendo Apache, Microsoft Internet Information Server, Personal Web Server, Netscape y iPlanet, Oreilly Website Pro server, Caudium, Xitami, OmniHTTPd y muchos otros.

source: For the majority of the servers PHP has a module, for the others supporting the CGI standard, PHP can work as a CGI processor.
es: PHP tiene módulos disponibles para la mayoría de los servidores, para aquellos otros que soporten el estándar CGI, PHP puede usarse como procesador CGI.

source: So with PHP, you have the freedom of choosing an operating system and a web server.
es: Asi que, con PHP teneis la libertad de escoger el sistema operativo y el servidor de vuestro gusto.

source: Furthermore, you also have the choice of using procedural programming or object oriented programming, or a mixture of them.
es: Tambien teneis la posibilidad de usar programación de procediminetos ó programación orientada a objetos.

source: Although not every standard OOP feature is realized in the current version of PHP, many code libraries and large applications (including the PEAR library) are written only using OOP code.
es: Aunque no todas la características estándares de la programación orientada a objetos están implementadas en la versión actual de PHP, muchas librerías y aplicaciones grandes (incluyendo la libreria PEAR) están escritas íntegramente usando programación orientada a objetos.

source: With PHP you are not limited to output HTML.
es: Con PHP no estais limitados a resultados en HTML.

source: PHP' s abilities includes outputting images, PDF files and even Flash movies (using libswf and Ming) generated on the fly.
es: Entre las habilidades de PHP se incluyen, creación de imágenes, ficheros PDF y películas Flash (usando libswf y Ming) sobre la marcha.

source: You can also output easily any text, such as XHTML and any other XML file.
es: Tambien podeis presentar otros resultados, como XHTM y ficheros XML.

source: PHP can autogenerate these files, and save them in the file system, instead of printing it out, forming a server-side cache for your dynamic content.
es: PHP puede autogenerar estos ficheros y grabarlos en el sistema de ficheros en vez de presentarlos en la pantalla.

source: One of the strongest and most significant feature in PHP is its support for a wide range of databases.
es: Quizas la característica más potente y destacable de PHP es su soporte para una gran cantidad de bases de datos.

source: Writing a database-enabled web page is incredibly simple.
es: Escribir un interfaz via web para una base de datos es una tarea simple con PHP.

source: The following databases are currently supported:
es: Las siguientes bases de datos están soportadas actualmente:

source: PHP also has support for talking to other services using protocols such as LDAP, IMAP, SNMP, NNTP, POP3, HTTP, COM (on Windows) and countless others.
es: PHP tambien tiene soporte para comunicarse con otros servicios usando protocolos tales como LDAP, IMAP, SNMP, NNTP, POP3, HTTP, COM (en Windows) y muchos otros.

source: You can also open raw network sockets and interact using any other protocol.
es: Tambien se pueden crear raw sockets.

source: PHP has support for the WDDX complex data exchange between virtually all Web programming languages.
es: PHP soporta WDDX para intercambio de datos entre lenguajes de programación en web.

source: You can also use our CORBA extension to access remote objects.
es: Y hablando de interconexión, PHP puede utilizar objetos Java de forma transparente como objetos PHP Y la extensión de CORBA puede ser utilizada para acceder a objetos remotos.

source: PHP has extremely useful text processing features, from the POSIX Extended or Perl regular expressions to parsing XML documents.
es: PHP tiene unas características muy útiles para el proceso de texto, desde expresiones regulares POSIX Extended ó Perl hasta parseador de documentos XML.

source: For parsing and accessing XML documents, we support the SAX and DOM standards.
es: Para parsear y acceder documentos XML, soportamos los estandares SAX y DOM.

source: You can use our XSLT extension to transform XML documents.
es: Podeis utilizar la extensión XSLT para transformar documentos XML.

source: While using PHP in the ecommerce field, you 'll find the Cybercash payment, CyberMUT, VeriSign Payflow Pro and CCVS functions useful for your online payment programs.
es: Si usais PHP en el campo del comercio electrónico, encontrareis muy útiles las funciones Cybercash, CyberMUT, VeriSign Payflow Pro y CCVS para vuestros programas de pago.

source: At last but not least, we have many other interesting extensions, the mnoGoSearch search engine functions, the IRC Gateway functions, many compression utilities (gzip, bz2), calendar conversion, translation...
es: Para terminar, tenemos muchas otras extensiones muy interesantes, las funciones del motor de búsquedas mnoGoSearch, funciones para pasarelas de IRC, utilidades de compresión (gzip, bz2),, conversión de calendarios, traducción.....

source: As you can see this page is not enough to list all the features and benefits PHP can offer.
es: Como podeis ver esta página no es suficiente para enumerar todas las características y beneficios que PHP ofrece.

source: Read on in the sections about installing PHP, and see the function reference part for explanation of the extensions mentioned here.
es: Consultar las secciones Instalando PHP y Referencia de las funciones para una explicación de las extensiones mencionadas aqui.

source: Keeping Current
es: Modulo Apache

source: Basic syntax
es: Síntaxis básica

source: Chapter 6.
es: Capítulo 6.

source: PHP supports' C', 'C++ 'and Unix shell-style comments.
es: PHP soporta el estilo de comentarios de 'C', 'C++' y de la interfaz de comandos de Unix.

source: The "one-line" comment styles actually only comment to the end of the line or the current block of PHP code, whichever comes first.
es: Los estilos de comentarios de una linea actualmente sólo comentan hasta el final de la linea o el bloque actual de código PHP, lo primero que ocurra.

source: You should be careful not to nest 'C' style comments, which can happen when commenting out large blocks.
es: Hay que tener cuidado con no anidar comentarios de estilo 'C', algo que puede ocurrir al comentar bloques largos de código.

source: The one-line comment styles actually only comment to the end of the line or the current block of PHP code, whichever comes first.
es: Los estilos de comentarios de una linea actualmente sólo comentan hasta el final de la linea o del bloque actual de código PHP, lo primero que ocurra.

source: WILL be printed:? skips out of the PHP mode and returns to HTML mode, and / / cannot influence that.
es: Esto implica que el código HTML tras / /? seráa impreso:? sale del modo PHP, retornando al modo HTML, el comentario / / no le influye.

source: Instruction separation
es: Separación de instrucciones

source: When PHP parses a file, it simply passes the text of the file through until it encounters one of the special tags which tell it to start interpreting the text as PHP code.
es: Para interpretar un archivo, php símplemente interpreta el texto del archivo hasta que encuentra uno de los carácteres especiales que delimitan el inicio de código PHP.

source: The parser then executes all the code it finds, up until it runs into a PHP closing tag, which tells the parser to just start passing the text through again.
es: El intérprete ejecuta entonces todo el código que encuentra, hasta que encuentra una etiqueta de fin de código, que le dice al intérprete que siga ignorando el código siguiente.

source: This is the mechanism which allows you to embed PHP code inside HTML: everything outside the PHP tags is left utterly alone, while everything inside is parsed as code.
es: Este mecanismo permite embeber código PHP dentro de HTML: todo lo que está fuera de las etiquetas PHP se deja tal como está, mientras que el resto se interpreta como código.

source: There are four sets of tags which can be used to denote blocks of PHP code.
es: Hay cuatro conjuntos de etiquetas que pueden ser usadas para denotar bloques de código PHP.

source: While the short-form tags and ASP-style tags may be convenient, they are not as portable as the longer versions.
es: Mientras que el formato corto de etiquetas (short-form tags) y el estilo ASP (ASP-style tags) pueden ser convenientes, no son portables como la versión de formato largo de etiquetas.

source: Also, if you intend to embed PHP code in XML or XHTML, you will need to use the ?php...? form to conform to the XML.
es: Además, si se pretende embeber código PHP en XML o XHTML, será obligatorio el uso del formato ?php...? para la compatibilidad con XML.

source: The tags supported by PHP are:
es: Las etiquetas soportadas por PHP son:

source: Example 6-1.
es: Ejemplo 6-1.

source: Ways of escaping from HTML
es: Formas de escapar de HTML

# 1. ?php echo( "if you want to serve XHTML or XML documents, do like this ");?
source: 1. ?php echo( "if you want to serve XHTML or XML documents, do like this\n");?
es: 1. ?php echo( "si quieres servir documentos XHTML o XML, haz como aqu iacute;\n");?

source: 2.? echo ("this is the simplest, an SGML processing instruction\n");? ?= expression?
es: 2.? echo ("esta es la m aacute;s simple, una instrucci oacute;n de procesado SGML \n");? ?= expression?

source: This is a shortcut for "? echo expression?" 3. script language="php "echo ("some editors (like FrontPage) don't like processing instructions"); / script 4.% echo ("You may optionally use ASP-style tags");% %= $variable; # This is a shortcut for"% echo... "%
es: Esto es una abreviatura de "? echo expression?" 3. script language="php "echo ("muchos editores (como FrontPage) no aceptan instrucciones de procesado"); / script 4.% echo ("Opcionalmente, puedes usar las etiquetas ASP");% %= $variable; # Esto es una abreviatura de"% echo... "%
